---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateMiddleStringer
source: html/cce87cbf-8796-f30c-a7d4-8267ca921895.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateMiddleStringer Property

Can't create one or more Middle Stringers.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateMiddleStringer { get; }
```